Documents/НачалоТермообработки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>НачалоТермообработки</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>МинДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинЧасы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинМинуты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоЧасы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоМинуты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксЧасы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксМинуты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтчетПроизводства</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОтчетПроизводстваЗаСмену</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодПрограмма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодПрограммыТермообработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументЗагрузка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗагрузкаКамеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИтогПоВидамРам</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТМЦ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТМЦ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРамы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыРам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кво</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КвоРам</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/НачалоТермообработки/Ext/ObjectModule.bsl
// Проверка заполнения шапки
Функция ПроверитьШапку(ОбъектДок, Отказ)

	Если НЕ ЗначениеЗаполнено(ОбъектДок.ПодПрограмма) Тогда
		СообщениеОбОшибке = Новый СообщениеПользователю;
		СообщениеОбОшибке.Текст = "Не заполнена Подпрограмма!";
		СообщениеОбОшибке.Поле = "ПодПрограмма";
		СообщениеОбОшибке.УстановитьДанные(ОбъектДок);
		СообщениеОбОшибке.Сообщить();
		Отказ = Истина;
	КонецЕсли; // Если НЕ ЗначениеЗаполнено ПодПрограмма // + claude

КонецФункции // ПроверитьШапку // + claude

// Проверка заполнения строк ТЧ
Функция ПроверитьСтроки(ОбъектДок, Отказ)

	Для Каждого Строка Из ОбъектДок.ТМЦ Цикл

		Если НЕ ЗначениеЗаполнено(Строка.ТМЦ) Тогда
			СообщениеОбОшибке = Новый СообщениеПользователю;
			СообщениеОбОшибке.Текст = "Не заполнено поле ТМЦ в строке " + Строка.НомерСтроки + "!";
			СообщениеОбОшибке.Поле = "ТМЦ[" + (Строка.НомерСтроки - 1) + "].ТМЦ";
			СообщениеОбОшибке.УстановитьДанные(ОбъектДок);
			СообщениеОбОшибке.Сообщить();
			Отказ = Истина;
			Возврат Ложь;
		КонецЕсли; // Если НЕ ЗначениеЗаполнено ТМЦ // + claude

	КонецЦикла; // Для Каждого Строка // + claude

	Возврат Истина;

КонецФункции // ПроверитьСтроки // + claude

// Обработка проведения документа
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	ПроверитьШапку(ЭтотОбъект, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли; // Если Отказ // + claude

	ПроверитьСтроки(ЭтотОбъект, Отказ);

КонецПроцедуры // ОбработкаПроведения // + claude

// Заполнение на основании Отчета производства за смену
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ОтчетПроизводстваЗаСмену") Тогда

		СтандартнаяОбработка = Ложь;
		ДокОснование = ДанныеЗаполнения.ПолучитьОбъект();

		ОтчетПроизводства = ДанныеЗаполнения;
		Дата               = ДокОснование.Дата;

		Для Каждого СтрокаОснования Из ДокОснование.Продукция Цикл
			НоваяСтрока     = ТМЦ.Добавить();
			НоваяСтрока.ТМЦ = СтрокаОснования.Номенклатура;
			НоваяСтрока.Кво = СтрокаОснования.Количество;
		КонецЦикла; // Для Каждого СтрокаОснования // + claude

	КонецЕсли; // Если ТипЗнч ОтчетПроизводстваЗаСмену // + claude

КонецПроцедуры // ОбработкаЗаполнения // + claude
